bagesoft/common/controllers/admin/Base.php

SELECT `admin`.* FROM `tb_admin` `admin` LEFT JOIN `tb_admin_group` `group` ON `admin`.`gid` = `group`.`id` WHERE admin.id=6
---
    public function init()
    {
        parent::init();
        $this->session = parent::_sessionGet('admin');

        if (empty($this->session)) {
            $keep = $this->keepLogin();
            if (false == $keep) {
                Yii::$app->response->redirect(Url::toRoute(['/public/login']))->send();
                Yii::$app->end();
                return;
            }
            $this->session = $keep;
        }

        $this->admin = Admin::find()->alias('admin')->joinWith('group group')->where('admin.id=:id', ['id' => $this->session['uid']])->one();