bagesoft/common/controllers/app/Base.php

    public function init()
    {
        parent::init();
        $this->session = parent::_sessionGet('zhaoshang');

        if (empty($this->session)) {
            $keep = $this->keepLogin();
            if (false == $keep) {
                Yii::$app->response->redirect(Url::toRoute(['/public/login']))->send();
                Yii::$app->end();
                return;
            }
            $this->session = $keep;
        }

        $this->user = User::find()->alias('user')->joinWith('group group')->where('user.id=:id', ['id' => $this->session['uid']])->one();
---
SELECT `user`.* FROM `tb_user` `user` LEFT JOIN `tb_user_group` `group` ON `user`.`gid` = `group`.`id` WHERE user.id=12