app/controllers/demand/PartnerController.php

INSERT INTO `tb_demand_works` (`content`, `attach_file`, `demand_id`, `uid`, `project_id`, `partner_uid`, `partner_name`, `worker_uid`, `worker_name`, `state`, `produce_num`, `created_at`, `audit_file`) VALUES ('测试提交流程', '3797', 67, 12, 295, 0, '', 73, '测试11234', 2, 1, 1763541434, '')
---
    public function actionWorksUpload()
    {
        parent::acl();
        $request = Yii::$app->request;
        $uid = (int) $this->session['uid'];
        $id = $request->post('id');
        try {
            $model = DemandFunc::getItemByUserMap($id, $uid);
            if (false == $model) {
                throw new Exception('创作记录不存在');
            } elseif ($model->demand->state == ProjectConst::DEMAND_STATUS_SUCCESS) {
                throw new Exception('该需求已经完成，无法上传作品');
            }
            $getWaitWorks = DemandFunc::getWaitWorks($model->demand->id);
            if ($getWaitWorks > 0) {
                throw new Exception('还有创作记录未审核,请等待审核结果');
            }
            //提交次数
            $produceNum = (int) DemandFunc::produceNum($model->demand->produce_num);
            $demandWorks = new DemandWorks();
            if (Yii::$app->request->isAjax && $demandWorks->load(Yii::$app->request->post())) {
                $demandWorks->demand_id = $model->id;
                $demandWorks->uid = $model->demand->uid;
                $demandWorks->project_id = $model->demand->project_id;
                $demandWorks->partner_uid = $model->demand->partner_uid;
                $demandWorks->partner_name = $model->demand->partner_name;
                $demandWorks->worker_uid = $uid;
                $demandWorks->worker_name = $this->session['username'];
                $demandWorks->state = ProjectConst::DEMAND_WORKS_AUDIT_WAIT;
                $demandWorks->produce_num = $produceNum;
                if ($demandWorks->validate() && $demandWorks->save()) {

UPDATE `tb_demand` SET `state`=96, `worker_first_at`=1763541434, `produce_num`=1 WHERE `id`=67
---
                    if ($model->demand->worker_first_at == 0) {
                        $model->demand->worker_first_at = time();
                    }
                    $model->demand->save();