app/controllers/DemandController.php

    public function actionCreate()
    {
        parent::acl();
        $request = Yii::$app->request;
        $source = intval($request->get('source'));
        $projectId = intval($request->get('projectId'));
        $uid = (int) $this->session['uid'];
        if ($source == System::SOURCE_CUSTOMER) {
            $customer = CustomerFunc::getItemByUserMap($projectId, $uid);
            $project = $customer->customer;
            $callback = Url::toRoute(['customer/index']);
        } else {
            $project = InvestFunc::getItemByIdAndUid($projectId, $uid);
            $callback = Url::toRoute(['invest/index']);
        }
        if (false == $project) {
            throw new NotFoundHttpException('项目不存在');
        }

        $model = new Demand();
        if ($model->load(Yii::$app->request->post())) {
            if ($model->validate()) {
                $model->uid = intval($project->uid);
                $model->username = trim($project->username);
                $model->partner_uid = intval($project->partner_uid);
                $model->partner_name = trim($project->partner_name);
                $model->project_id = intval($project->id);
                $model->project_name = $project->project_name;
                $model->state = ProjectConst::DEMAND_STATUS_WAIT_PARTNER;
                $model->source = intval($source);
                if ($model->save()) {
---
INSERT INTO `tb_demand` (`project_location`, `hope_time`, `attach_file`, `uid`, `username`, `partner_uid`, `partner_name`, `project_id`, `project_name`, `state`, `source`, `created_at`, `remind_at`, `is_remind`) VALUES ('ABC项目测试20251119-2提交作品', '2025-11-29 17:00', '', 12, '李敏', 0, '', 295, 'ABC项目测试', 97, 2, 1763541283, 1764406800, 1)

    public function actionItem($id)
    {
        parent::acl();
        $model = DemandFunc::getItemByUserMap($id, (int) $this->session['uid']);
        if (false == $model) {
            throw new NotFoundHttpException('需求记录不存在');
        }
        $demand = $model->demand;
        if ($demand->source == System::SOURCE_CUSTOMER) {
            $project = CustomerFunc::getItemById($demand->project_id);
        } else {
            $project = InvestFunc::getItemById($demand->project_id);
        }
        if (false == $project) {
            throw new NotFoundHttpException('项目不存在');
        }

        $worksModel = new DemandWorks();
        $worksList = $worksModel->find()->where('demand_id=:demandId', ['demandId' => $model->id])->orderBy('id DESC')->all();
---
SELECT * FROM `tb_demand_works` WHERE demand_id=67 ORDER BY `id` DESC

                $demandWorks->audit_uid = $uid;
                $demandWorks->audit_name = $this->session['username'];

                if ($demandWorks->save()) {
---
UPDATE `tb_demand_works` SET `reply_content`='', `state`=3, `audit_uid`=12, `audit_name`='李敏', `audit_at`=1763541516 WHERE `id`=66