app/controllers/InvestController.php

    public function actionItem($id)
    {
        parent::acl();
        $model = InvestFunc::getItemByUidOrMgrId($id, $this->session['uid']);
        if (false == $model) {
            throw new NotFoundHttpException('记录不存在');
        }
        VisitFunc::log($this->session, $model, System::SOURCE_INVEST);
        $model->views += 1;
        $model->save();
---
UPDATE `tb_invest` SET `views`=11 WHERE `id`=295