app/controllers/MaintainController.php

SELECT `maintain_id` FROM `tb_maintain_user_map` WHERE `uid`=73
SELECT `project_id` FROM `tb_customer_user_map` WHERE `uid`=73
---
    public function actionIndex()
    {
        parent::acl();
        $request = Yii::$app->request;
        $projectName = trim($request->get('projectName'));
        $parterName = trim($request->get('parterName'));
        $typeid = trim($request->get('typeid'));
        $state = intval($request->get('state'));
        $dateAt = trim($request->get('date'));
        $dateAt = Utils::dateRange($dateAt);
        $uid = $this->session['uid'];
        // 1. 获取当前用户自己的维护记录ID（通过用户映射表）
        $personalMaintainIds = MaintainUserMap::find()
            ->where(['uid' => $uid])
            ->select('maintain_id')
            ->column();
        // 2. 获取当前用户关联的项目ID（根据实际业务调整关联字段）
        // 假设用户通过Customer_user_map表关联市场项目
        $relatedProjectIds = CustomerUserMap::find()
            ->where(['uid' => $uid])
            ->select('project_id')
            ->column();

SELECT `project_id` FROM `tb_invest_user_map` WHERE `uid`=73
---
        }
        //4. 获取当前用户关联的项目ID（根据实际业务调整关联字段）
        // 假设用户通过Invest_user_map表关联招商项目
        $relatedInvestIds = InvestUserMap::find()
            ->where(['uid' => $uid])
            ->select('project_id')
            ->column();

SELECT COUNT(*) FROM `tb_maintain` `maintain` WHERE 0=1
SELECT * FROM `tb_maintain` `maintain` WHERE 0=1 ORDER BY `maintain`.`id` DESC LIMIT 20
---
        if ($dateAt['start'] > 0 && $dateAt['end'] > 0) {
            $model->andWhere(['between', 'maintain.created_at', $dateAt['start'], $dateAt['end']]);
        }
        $count = $model->count();
        $pagination = new Pagination(['totalCount' => $count, 'pageSize' => '20', 'defaultPageSize' => 20]);

        $datalist = $model->offset($pagination->offset)->limit($pagination->limit)->orderBy('maintain.id DESC')->asArray()->all();