admin/controllers/DemandController.php

    public function actionItem($id)
    {
        parent::acl();
        $model = DemandFunc::getItemById($id);
        if (false == $model) {
            throw new NotFoundHttpException('记录不存在');
        }
        if ($model->source == System::SOURCE_CUSTOMER) {
            $project = CustomerFunc::getItemById($model->project_id);
        } else {
            $project = InvestFunc::getItemById($model->project_id);
        }
        if (false == $project) {
            throw new NotFoundHttpException('项目不存在');
        }

        $worksModel = new DemandWorks();
        $worksList = $worksModel->find()->where('demand_id=:demandId', ['demandId' => $model->id])->orderBy('id DESC')->all();
---
SELECT * FROM `tb_demand_works` WHERE demand_id=67 ORDER BY `id` DESC

    public function actionAssignWorker()
    {
        parent::acl('demand/assign-worker');
        try {
            $request = Yii::$app->request;
            $demandId = intval($request->post('demandId'));
            $model = $this->findModel($demandId);
            //$oldWorkerUid = $model->worker_uid;
            //赋值
            $postData = Yii::$app->request->post('Demand', []);
            $workerUids = isset($postData['worker_uid']) ? array_filter(array_map('intval', $postData['worker_uid'])) : [];
            if (empty($workerUids)) {
                throw new \Exception('请选择至少一个研究员');
            }
            foreach ($workerUids as $uid) {
                $user = UserFunc::getUserById($uid);
                if (!$user) {
                    throw new \Exception("研究员ID:{$uid}不存在");
                }
            }
            // 3. 查询该需求已有的用户关联记录（用于存在性判断）
            $existingUids = DemandUserMap::find()
                ->where([
                    'demand_id' => $demandId,
                    'role_type' => System::WORKER // 创作者角色，根据实际业务调整
                ])
                ->select('uid')
                ->column(); // 返回已存在的用户ID数组
            $deleteUids = array_diff($existingUids, $workerUids);
            if (!empty($deleteUids)) {
            // 批量删除差异记录
                DemandUserMap::deleteAll([
                    'demand_id' => $demandId,
                    'uid' => $deleteUids,
                    'role_type' => System::WORKER
                ]);
---
SELECT `uid` FROM `tb_demand_user_map` WHERE (`demand_id`=67) AND (`role_type`=3)
DELETE FROM `tb_demand_user_map` WHERE (`demand_id`=66) AND (`uid` IN (15, 20)) AND (`role_type`=3)

                $user = UserFunc::getUserById($uid);
                DemandFunc::addMap($demandId, $uid);
            }
            $existingTaskUids = DemandTask::find()
                ->where([
                    'demand_id' => $demandId
                ])
                ->select('worker_uid')
                ->column(); // 返回已存在的用户ID数组
---
SELECT `worker_uid` FROM `tb_demand_task` WHERE `demand_id`=67

    public function findModel($id)
    {
        if (($model = Demand::findOne($id)) !== null) {
---
SELECT * FROM `tb_demand` WHERE `id`=67