admin/controllers/MaintainController.php

SELECT COUNT(*) FROM `tb_maintain` `maintain`
SELECT * FROM `tb_maintain` `maintain` ORDER BY `maintain`.`id` DESC LIMIT 20
---
        if ($dateAt['start'] > 0 && $dateAt['end'] > 0) {
            $model->andWhere(['between', 'maintain.created_at', $dateAt['start'], $dateAt['end']]);
        }
        $count = $model->count();
        $pagination = new Pagination(['totalCount' => $count, 'pageSize' => '20', 'defaultPageSize' => 20]);

        $datalist = $model->offset($pagination->offset)->limit($pagination->limit)->orderBy('maintain.id DESC')->asArray()->all();