bagesoft/models/Config.php

SELECT * FROM `tb_config`
---
    public static function _loadAll($vars = [])
    {
        $model = static::find();
        if (isset($vars['condition'])) {
            $model->where($vars['condition'], $vars['params']);
        }
        $datas = $model->all();