bagesoft/models/Demand.php

INSERT INTO `tb_demand_user_map` (`uid`, `demand_id`, `role_type`) VALUES (12, 67, 1)
---
    public function afterSave($insert, $changedAttributes)
    {
        parent::afterSave($insert, $changedAttributes);
        if ($insert) {
            //发布者
            $userMap = new DemandUserMap();
            $userMap->uid = intval($this->uid);
            $userMap->demand_id = $this->id;
            $userMap->role_type = System::OWNER;
            $userMap->save();