bagesoft/models/Invest.php

SELECT * FROM `tb_user` WHERE `id`=19
---
    public function beforeSave($insert)
    {
        if (!parent::beforeSave($insert)) {
            return false;
        }
        $user = User::findOne($this->manager_uid);