bagesoft/functions/DemandFunc.php

SELECT * FROM `tb_demand_works` WHERE id=66 AND (uid=12 OR partner_uid=12) LIMIT 1
---
    public static function getWorksItemByIdAndUidPartnerUid($id, $uid)
    {
        return DemandWorks::find()->where('id=:id AND (uid=:uid OR partner_uid=:parterUid)', ['id' => $id, 'uid' => $uid, 'parterUid' => $uid])->limit(1)->one();

SELECT `demand`.*, `userMap`.`uid`, `userMap`.`demand_id` FROM `tb_demand_user_map` `userMap` LEFT JOIN `tb_demand` `demand` ON `userMap`.`demand_id` = `demand`.`id` WHERE demand.id='67' AND userMap.uid=73 LIMIT 1
---
    public static function getItemByUserMap($id, $uid)
    {
        return DemandUserMap::find()->alias('userMap')->joinWith('demand AS demand')->select('demand.*,userMap.uid,userMap.demand_id')->where('demand.id=:id AND userMap.uid=:uid', ['id' => $id, 'uid' => $uid])->limit(1)->one();

SELECT * FROM `tb_demand` WHERE `id`='67'
---
    public static function getItemById($id)
    {
        return Demand::findOne($id);

SELECT COUNT(*) FROM `tb_demand_works` WHERE demand_id=67 AND state=2
---
    public static function getWaitWorks($demandId)
    {
        return DemandWorks::find()->where('demand_id=:demand_id AND state=:state', ['demand_id' => $demandId, 'state' => ProjectConst::DEMAND_WORKS_AUDIT_WAIT])->count();

INSERT INTO `tb_demand_user_map` (`demand_id`, `uid`, `role_type`) VALUES (67, 12, 3)
---
    public static function addMap($demandId, $uid, $roleType = System::WORKER)
    {
        $map = new DemandUserMap();
        $map->demand_id = $demandId;
        $map->uid = $uid;
        $map->role_type = $roleType;
        $map->save();