bagesoft/functions/InvestFunc.php

    public static function getItemByIdAndUid($id, $uid)
    {
        return Invest::find()->where('id=:id AND uid=:uid', ['id' => $id, 'uid' => $uid])->limit(1)->one();
---
SELECT * FROM `tb_invest` WHERE id=295 AND uid=12 LIMIT 1

    public static function getItemByUidOrMgrId($id, $uid)
    {
        return Invest::find()->where('id=:id AND (uid=:uid OR manager_uid=:managerUid OR vice_manager_uid=:vicemanagerUid )', ['id' => $id, 'uid' => $uid, 'managerUid' => $uid , 'vicemanagerUid' => $uid])->limit(1)->one();
---
SELECT * FROM `tb_invest` WHERE id='295' AND (uid=12 OR manager_uid=12 ) LIMIT 1

    public static function getItemById($id)
    {
        return Invest::find()->where('id=:id', ['id' => $id])->limit(1)->one();
---
SELECT * FROM `tb_invest` WHERE id=295 LIMIT 1