bagesoft/functions/MaintainFunc.php

SELECT COUNT(*) FROM `tb_maintain` `maintain` LEFT JOIN `tb_user`u ON maintain.uid=u.id WHERE project_id=295 AND source=2
SELECT `maintain`.*, `u`.`username` FROM `tb_maintain` `maintain` LEFT JOIN `tb_user`u ON maintain.uid=u.id WHERE project_id=295 AND source=2 ORDER BY `maintain`.`id` DESC LIMIT 20
---
    public static function getMaintianListById($id, $source = System::SOURCE_CUSTOMER)
    {
        $model = Maintain::find()->alias('maintain');
        $model->leftJoin(User::tableName() . 'u', 'maintain.uid=u.id');
        $model->where('project_id=:projectId AND source=:source', ['projectId' => $id, 'source' => $source]);
        $model->select(['maintain.*', 'u.username']);
        $count = $model->count();
        $pagination = new Pagination(['totalCount' => $count, 'pageSize' => '20', 'defaultPageSize' => 20]);
        $maintains = $model->offset($pagination->offset)->limit($pagination->limit)->orderBy('maintain.id DESC')->asArray()->all();