bagesoft/functions/TagsFunc.php

SELECT * FROM `tb_tags` WHERE catid=5
---
    public static function getTagsList($catid = 5)
    {
        $tags = Tags::find()->where('catid=:catid', ['catid' => $catid])->all();

SELECT * FROM `tb_tags` WHERE id=31 LIMIT 1
---
    public static function getTagsName($tagid)
    {
        $tag = Tags::find()->where('id=:id', ['id' => $tagid])->limit(1)->one();