bagesoft/functions/UploadFunc.php

UPDATE `tb_upload` SET `project_id`=295 WHERE `id`='1077'
---
    public static function relateProject($uploadIds, $projectId)
    {
        if (empty($uploadIds)) {
            return;
        }
        // 将字符串分割成数组
        $files = explode(',', $uploadIds);

        // 过滤掉非数字的值
        $numericFiles = array_filter($files, function ($value) {
            // 去除首尾空格并检查是否为数字
            return is_numeric(trim($value));
        });

        // 如果过滤后数组为空，则说明没有有效的ID，直接返回
        if (empty($numericFiles)) {
            // （可选）你可以在这里记录一条日志，说明提供的uploadIds无效
            // error_log("relateProject: 在 uploadIds 中没有找到有效的数字ID: " . $uploadIds);
            return;
        }

        // 使用过滤后的有效数字ID执行更新操作
        Upload::updateAll(['project_id' => $projectId], ['in', 'id', $numericFiles]);

SELECT * FROM `tb_upload` WHERE source=2 AND project_id=295
---
    public static function getlist($source, $projectId)
    {
        $datalist = Upload::find()->where('source=:source AND project_id=:projectId', ['source' => $source, 'projectId' => $projectId])->all();