bagesoft/functions/UserFunc.php

    public static function getUserById($uid)
    {
        return User::findOne($uid);
---
SELECT * FROM `tb_user` WHERE `id`=19

    public static function getWorkers()
    {
        $model = User::find();
        $model->alias('user');
        $model->where('user.state=:state', ['state' => UserConst::STATUS_ACTIVE]);
        $model->leftJoin(UserGroup::tableName() . ' group', 'user.gid = group.id');
        $model->orderBy('user.gid');
        $datalist = $model->all();
---
SELECT `user`.* FROM `tb_user` `user` LEFT JOIN `tb_user_group` `group` ON user.gid = group.id WHERE user.state=1 ORDER BY `user`.`gid`