bagesoft/functions/VisitFunc.php

INSERT INTO `tb_visit` (`uid`, `project_source`, `visit_source`, `visit_uid`, `visit_user`, `project_id`, `project_name`, `created_at`) VALUES (12, 2, 1, 12, '李敏', 295, 'ABC项目测试', 1763541377)
---
    public static function log($session, $project, $source)
    {
        // if ($session['role'] == System::USER_ROLE_ADMIN && $session['uid'] == 1) {
        //     return;!!!debug!!!
        // }
        //只需通知当事人
        $model = new Visit();
        $model->uid = intval($project->uid);
        $model->project_source = intval($source);
        $model->visit_source = intval($session['role']);
        $model->visit_uid = intval($session['uid']);
        $model->visit_user = trim($session['username']);
        $model->project_id = intval($project->id);
        $model->project_name = trim($project->project_name);
        $model->save();